using System;
using System.Collections;
using System.Collections.Generic;
using System.ComponentModel;
using System.Diagnostics;
using System.Drawing;
using System.Linq;
using System.Linq.Expressions;
using System.Media;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading;
using System.Windows.Forms;

namespace Aganonki
{        
    class Program
    {

        #region OFFSETS
        public static int offsetMiscEntityList = 0x00;
        public static int offsetMiscLocalPlayer = 0x00;
        public static int offsetMiscJump = 0x00;
        public static int offsetMiscClientState = 0x00;
        public static int offsetMiscSetViewAngles = 0x00;
        public static int offsetMiscGlowManager = 0x00;
        public static int offsetMiscSignOnState = 0xE8;
        public static int offsetMiscWeaponTable = 0x04A5DC4C;
        public static int offsetvMatrix = 0x00;
        private static int offsetEntityCrosshair;
        public static int offsetEntityID = 0x00;
        public static int offsetEntityHealth = 0x00;
        public static int offsetEntityVecOrigin = 0x00;

        public static int offsetPlayerTeamNum = 0x00;
        public static int offsetPlayerBoneMatrix = 0x00;

        public static int offsetPlayerWeaponHandle = 0x12C0;   // m_hActiveWeapon
        public static int offsetWeaponId = 0x1690;   // Search for weaponid
        #endregion

        public static int[] entityAddresses;

                Program.offsetEntityID = tmp;
            }
        }
        static void EntityHealth(MemUtils memUtils)
        {
            scan = memUtils.PerformSignatureScan(
                new byte[] { 0x8B, 0x41, 0x00, 0x89, 0x41, 0x00, 0x8B, 0x41, 0x00, 0x89, 0x41, 0x00, 0x8B, 0x41, 0x00, 0x89, 0x41, 0x00, 0x8B, 0x4F, 0x00, 0x83, 0xB9, 0x00, 0x00, 0x00, 0x00, 0x00, 0x7F, 0x2E },
                "xx?xx?xx?xx?xx?xx?xx?xx????xxx", clientDll);
            if (scan.Success)
            {
                int tmp = memUtils.Read<int>((IntPtr)(scan.Address.ToInt32() + 23));
                Program.offsetEntityHealth = tmp;
            }
        }
        static void EntityVecOrigin(MemUtils memUtils)
        {
            scan = memUtils.PerformSignatureScan(
                new byte[] { 0x8A, 0x0E, 0x80, 0xE1, 0xFC, 0x0A, 0xC8, 0x88, 0x0E, 0xF3, 0x00, 0x00, 0x87, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x87, 0x00, 0x00, 0x00, 0x00, 0x9F },
                "xxxxxxxxxx??x??????x????x", clientDll);
            if (scan.Success)
            {
                int tmp = memUtils.Read<int>((IntPtr)(scan.Address.ToInt32() + 13));
                Program.offsetEntityVecOrigin = tmp;
            }
        }
        #endregion
        #region PLAYER
        static void PlayerTeamNum(MemUtils memUtils)
        {
            scan = memUtils.PerformSignatureScan(
                new byte[] { 0xCC, 0xCC, 0xCC, 0x8B, 0x89, 0x00, 0x00, 0x00, 0x00, 0xE9, 0x00, 0x00, 0x00, 0x00, 0xCC, 0xCC, 0xCC, 0xCC, 0xCC, 0x8B, 0x81, 0x00, 0x00, 0x00, 0x00, 0xC3, 0xCC, 0xCC },
                "xxxxx????x????xxxxxxx????xxx", clientDll);
            if (scan.Success)
            {
                int tmp = memUtils.Read<int>((IntPtr)(scan.Address.ToInt32() + 5));
                Program.offsetPlayerTeamNum = tmp;
            }
        }
        static void PlayerBoneMatrix(MemUtils memUtils)
        {
            scan = memUtils.PerformSignatureScan(
                new byte[] { 0x83, 0x3C, 0xB0, 0xFF, 0x75, 0x15, 0x8B, 0x87, 0x00, 0x00, 0x00, 0x00, 0x8B, 0xCF, 0x8B, 0x17, 0x03, 0x44, 0x24, 0x0C, 0x50 },
                "xxxxxxxx????xxxxxxxxx", clientDll);
            if (scan.Success)
            {
                int tmp = memUtils.Read<int>((IntPtr)(scan.Address.ToInt32() + 8));
                Program.offsetPlayerBoneMatrix = tmp;
            }
        }
        static void PlayerWeaponHandle(MemUtils memUtils)
        {
            scan = memUtils.PerformSignatureScan(
                new byte[] { 0x0F, 0x45, 0xF7, 0x5F, 0x8B, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x5E, 0x83, 0xF9, 0xFF },
                "xxxxxx????xxxx", clientDll);
            if (scan.Success)
            {
                int tmp = memUtils.Read<int>((IntPtr)(scan.Address.ToInt32() + 6));
                Program.offsetPlayerWeaponHandle = tmp;
            }
        }
        #endregion

    }

    [StructLayout(LayoutKind.Explicit)]
    public struct GlowObjectDefinition
    {
        [FieldOffset(0x00)]
        public int pEntity;
        [FieldOffset(0x04)]
        public float r;
        [FieldOffset(0x08)]
        public float g;
        [FieldOffset(0x0C)]
        public float b;
        [FieldOffset(0x10)]
        public float a;

        //16 bytes junk
        [FieldOffset(0x14)]
        public int junk01;
        [FieldOffset(0x18)]
        public int junk02;
        [FieldOffset(0x1C)]
        public int junk03;
        [FieldOffset(0x20)]
        public int junk04;

        [FieldOffset(0x24)]
        public bool m_bRenderWhenOccluded;
        [FieldOffset(0x25)]
        public bool m_bRenderWhenUnoccluded;
        [FieldOffset(0x26)]
        public bool m_bFullBloom;

        //10 bytes junk
        [FieldOffset(0x2A)]
        public int junk05;
        [FieldOffset(0x2E)]
        public int junk06;
        [FieldOffset(0x32)]
        public short junk07;
    }

    public enum ClassID
    {
        AK47 = 1,
        BaseAnimating = 2,
        BaseDoor = 10,
        BaseEntity = 11,
        BaseTrigger = 20,
        C4 = 28,
        CSGameRulesProxy = 33,
        CSPlayer = 34,
        CSPlayerResource = 35,
        CSRagdoll = 36,
        CSTeam = 37,
        CascadeLight = 29,
        Chicken = 30,
        ColorCorrection = 31,
        DEagle = 38,
        DecoyGrenade = 39,
        DynamicProp = 42,
        EnvDetailController = 50,
        EnvTonemapController = 57,
        EnvWind = 58,
        Flashbang = 63,
        FogController = 64,
        FuncBrush = 69,
        FuncOccluder = 74,
        FuncRotating = 76,
        Func_Dust = 66,
        HEGrenade = 81,
        Hostage = 82,
        IncendiaryGrenade = 84,
        Inferno = 85,
        Knife = 88,
        KnifeGG = 88,
        LightGlow = 90,
        MolotovGrenade = 92,
        ParticleSystem = 97,
        PhysicsProp = 100,
        PhysicsPropMultiplayer = 101,
        PlantedC4 = 103,
        PostProcessController = 109,
        PredictedViewModel = 112,
        PropDoorRotating = 114,
        RopeKeyframe = 120,
        ShadowControl = 123,
        SmokeGrenade = 125,
        SmokeStack = 126,
        Sprite = 129,
        Sun = 134,
        VGuiScreen = 190,
        VoteController = 191,
        WeaponAUG = 194,
        WeaponAWP = 195,
        WeaponBizon = 196,
        WeaponElite = 200,
        WeaponFiveSeven = 202,
        WeaponG3SG1 = 203,
        WeaponGalilAR = 205,
        WeaponGlock = 206,
        WeaponHKP2000 = 207,
        WeaponM249 = 208,
        WeaponM4A1 = 210,
        WeaponMP7 = 214,
        WeaponMP9 = 215,
        WeaponMag7 = 212,
        WeaponNOVA = 217,
        WeaponNegev = 216,
        WeaponP250 = 219,
        WeaponP90 = 220,
        WeaponSCAR20 = 222,
        WeaponSG556 = 226,
        WeaponSSG08 = 227,
        WeaponTaser = 228,
        WeaponTec9 = 229,
        WeaponUMP45 = 231,
        WeaponUMP45x = 232,
        WeaponXM1014 = 233,
        WeaponM4 = 211,
        WeaponNova = 218,
        WeaponMAG = 213,
        ParticleSmokeGrenade = 237,
        Weapon = 0xBEEF,
        Unknown = 0xDEAD,
        ParticleDecoy = 40,
        ParticleFlash = 9,
        ParticleIncendiaryGrenade = 93,
        WeaponG3SG1x = 204,
        WeaponDualBerettas = 201,
        WeaponTec9x = 230,
        WeaponPPBizon = 197,
        WeaponP90x = 221,
        WeaponSCAR20x = 223,
        WeaponXM1014x = 234,
        WeaponM249x = 209,
    }

    public static class Glow
    {
        public static bool GlowCheck(ClassID id, CSGOPlayer entity, ref Color clr)
        {
            switch (id)
            {            
                case ClassID.CSPlayer:
                    {
                        if (entity.m_iTeam == Program.localPlayer.m_iTeam)
                            clr = Color.Blue;
                        else if (entity.m_bSpotted && (entity.m_iTeam == 3 || entity.m_iTeam == 2))
                            clr = Color.Green;
                        else
                            clr = Program.trollmod?Color.FromArgb(Program.lol.Next(1,254),Program.lol.Next(1,254),Program.lol.Next(1,254),Program.lol.Next(1,254)):Color.Red;
                        break;
                    }
                case ClassID.AK47:
                case ClassID.DEagle:
                case ClassID.WeaponAUG:
                case ClassID.WeaponAWP:
                case ClassID.WeaponBizon:
                case ClassID.WeaponElite:
                case ClassID.WeaponFiveSeven:
                case ClassID.WeaponG3SG1:
                case ClassID.WeaponGalilAR:
                case ClassID.WeaponGlock:
                case ClassID.WeaponHKP2000:
                case ClassID.WeaponM249:
                case ClassID.WeaponM249x:
                case ClassID.WeaponM4A1:
                case ClassID.WeaponMP7:
                case ClassID.WeaponMP9:
                case ClassID.WeaponMag7:
                case ClassID.WeaponNOVA:
                case ClassID.WeaponNegev:
                case ClassID.WeaponP250:
                case ClassID.WeaponP90:
                case ClassID.WeaponP90x:
                case ClassID.WeaponSCAR20:
                case ClassID.WeaponSG556:
                case ClassID.WeaponSSG08:
                case ClassID.WeaponTaser:
                case ClassID.WeaponTec9:
                case ClassID.WeaponTec9x:
                case ClassID.WeaponUMP45:
                case ClassID.WeaponXM1014:
                case ClassID.Weapon:
                case ClassID.WeaponNova:
                case ClassID.WeaponM4:
                case ClassID.WeaponUMP45x:
                case ClassID.WeaponXM1014x:
                case ClassID.WeaponMAG:
                case ClassID.WeaponG3SG1x:
                case ClassID.WeaponDualBerettas:
                case ClassID.WeaponPPBizon:
                case ClassID.WeaponSCAR20x:
                    {
                        clr = Color.Violet;
                        break;
                    }
                case ClassID.HEGrenade:
                case ClassID.SmokeGrenade:
                case ClassID.MolotovGrenade:
                case ClassID.IncendiaryGrenade:
                case ClassID.Flashbang:
                case ClassID.DecoyGrenade:
                case ClassID.ParticleDecoy:
                case ClassID.ParticleSmokeGrenade:
                case ClassID.SmokeStack:
                case ClassID.ParticleIncendiaryGrenade:
                case ClassID.ParticleFlash:
                    {
                        clr = Color.DarkRed;
                        break;
                    }
                case ClassID.Hostage:
                case ClassID.Chicken:
                    {
                        clr = Color.HotPink;
                        break;
                    }
                case ClassID.C4:
                case ClassID.PlantedC4:
                    {
                        clr = Color.DarkViolet;
                        break;
                    }
                //case ClassID.DynamicProp:
                //case ClassID.Inferno:
                //case ClassID.BaseAnimating:
                //case ClassID.BaseDoor:
                //case ClassID.BaseEntity:
                //case ClassID.BaseTrigger:
                //case ClassID.CSGameRulesProxy:
                //case ClassID.CSPlayerResource:
                //case ClassID.CSRagdoll:
                //case ClassID.CascadeLight:
                //case ClassID.ColorCorrection:
                //case ClassID.EnvDetailController:
                //case ClassID.EnvTonemapController:
                //case ClassID.EnvWind:
                //case ClassID.FogController:
                //case ClassID.FuncBrush:
                //case ClassID.FuncOccluder:
                //case ClassID.FuncRotating:
                //case ClassID.Func_Dust:
                //case ClassID.LightGlow:
                //case ClassID.ParticleSystem:
                //case ClassID.PhysicsProp:
                //case ClassID.PhysicsPropMultiplayer:
                //case ClassID.PostProcessController:
                //case ClassID.PredictedViewModel:
                //case ClassID.PropDoorRotating:
                //case ClassID.RopeKeyframe:
                //case ClassID.ShadowControl:
                //case ClassID.Sprite:
                //case ClassID.Sun:
                //case ClassID.VGuiScreen:
                //case ClassID.VoteController:
                //case ClassID.Knife:
                default:
                    break;
            }
            return clr == Color.Black;
        }

    }

    [StructLayout(LayoutKind.Explicit)]
    public struct CSGOPlayer
    {
        [FieldOffset(0x8)]
        public int m_iVirtualTable;

        [FieldOffset(0x64)]
        public int m_iID;

        [FieldOffset(0xE9)]
        public byte m_iDormant;

        [FieldOffset(0xF0)]
        public int m_iTeam;

        [FieldOffset(0xFC)]
        public int m_iHealth;

        [FieldOffset(0x134)]
        public Vector3 m_vecOrigin;

        [FieldOffset(0x935)]
        public bool m_bSpotted;

        [FieldOffset(0xA78)]
        public int m_pBoneMatrix;

        [FieldOffset(0x12C0)]
        public uint m_hActiveWeapon;

        public bool IsValid(MemUtils memUtils)
        {
            return this.m_iID != 0 && this.m_iDormant != 1 && this.m_iHealth > 0 && (m_iTeam == 2 || m_iTeam == 3);
        }

        public int GetBoneAddress(int boneIndex)
        {
            return m_pBoneMatrix + boneIndex * 0x30;
        }
        public int GetClientClass(MemUtils memUtils)
        {
            int function = memUtils.Read<int>((IntPtr)(m_iVirtualTable + 2 * 0x04));
            return memUtils.Read<int>((IntPtr)(function + 0x01));
        }
        public int GetClassID(MemUtils memUtils)
        {
            return memUtils.Read<int>((IntPtr)(GetClientClass(memUtils) + 20));
        }
        public String GetName(MemUtils memUtils)
        {
            int ptr = memUtils.Read<int>((IntPtr)(GetClassID(memUtils) + 8));
            return memUtils.ReadString((IntPtr)(ptr + 8), 32, Encoding.ASCII);
        }
        public CSGOWeapon GetActiveWeapon(MemUtils memUtils)
        {
            if (this.m_hActiveWeapon == 0xFFFFFFFF)
                return new CSGOWeapon() { m_iItemDefinitionIndex = 0, m_iWeaponID = 0 };

            uint handle = this.m_hActiveWeapon & 0xFFF;
            int weapAddress = memUtils.Read<int>((IntPtr)(Program.entityAddresses[handle - 1]));
            return memUtils.Read<CSGOWeapon>((IntPtr)weapAddress);
        }
    }
    [StructLayout(LayoutKind.Explicit)]
    public struct CSGOEntity
    {
        [FieldOffset(0x8)]
        public uint m_iVirtualTable;

        [FieldOffset(0x64)]
        public int m_iID;

        [FieldOffset(0xE9)]
        public byte m_iDormant;

        [FieldOffset(0x148)]
        public short m_hOwner;

        public bool IsValid(MemUtils memUtils)
        {
            return this.m_iID != 0 && this.m_iDormant != 1 && this.m_iVirtualTable != 0 && this.m_iVirtualTable != 0xFFFFFFFF;
        }
        public int GetClientClass(MemUtils memUtils)
        {
            uint function = memUtils.Read<uint>((IntPtr)(m_iVirtualTable + 2 * 0x04));
            if (function != 0xFFFFFFFF)
                return memUtils.Read<int>((IntPtr)(function + 0x01));
            else
                return -1;
        }
        public int GetClassID(MemUtils memUtils)
        {
            try
            {
                int clientClass = GetClientClass(memUtils);
                if (clientClass != -1)
                    return memUtils.Read<int>((IntPtr) (clientClass + 20));
                return clientClass;
            }
            catch
            {
                return 0;
            }
        }
        public string GetName(MemUtils memUtils)
        {
            int clientClass = GetClientClass(memUtils);
            if (clientClass != -1)
            {
                int ptr = memUtils.Read<int>((IntPtr)(GetClassID(memUtils) + 8));
                return memUtils.ReadString((IntPtr)(ptr + 8), 32, Encoding.ASCII);
            }
            return "none";
        }
    }

    public enum SignOnState
    {
        SIGNONSTATE_NONE = 0,
        SIGNONSTATE_CHALLENGE = 1,
        SIGNONSTATE_CONNECTED = 2,
        SIGNONSTATE_NEW = 3,
        SIGNONSTATE_PRESPAWN = 4,
        SIGNONSTATE_SPAWN = 5,
        SIGNONSTATE_FULL = 6,
        SIGNONSTATE_CHANGELEVEL = 7
    }
    [StructLayout(LayoutKind.Explicit)]
    struct CSGOLocalPlayer
    {
        [FieldOffset(0x64)]
        public int m_iID;

        [FieldOffset(0xF0)]
        public int m_iTeam;

        [FieldOffset(0xFC)]
        public int m_iHealth;

        [FieldOffset(0x100)]
        public int m_iFlags;

        [FieldOffset(0x104)]
        public Vector3 m_vecViewOffset;

        [FieldOffset(0x110)]
        public Vector3 m_vecVelocity;

        [FieldOffset(0x134)]
        public Vector3 m_vecOrigin;

        [FieldOffset(0x12C0)]
        public uint m_hActiveWeapon;

        [FieldOffset(0x13E8)]
        public Vector3 m_vecPunch;

        [FieldOffset(0x1d6C)]
        public int m_iShotsFired;

        [FieldOffset(0x2410)]
        public int m_iCrosshairIdx;

        public bool IsValid()
        {
            return this.m_iID != 0 && this.m_iHealth > 0 && (m_iTeam == 2 || m_iTeam == 3);
        }
        public CSGOWeapon GetActiveWeapon(MemUtils memUtils)
        {
            try{
            if (this.m_hActiveWeapon == 0xFFFFFFFF)
                return new CSGOWeapon() { m_iItemDefinitionIndex = 0, m_iWeaponID = 0 };

            uint handle = this.m_hActiveWeapon & 0xFFF;
            int weapAddress = Program.entityAddresses[handle - 1];
            return memUtils.Read<CSGOWeapon>((IntPtr)weapAddress);
            }
            catch
            {
                return new CSGOWeapon{m_iWeaponID = 0};
            }
        }
    }
    [StructLayout(LayoutKind.Explicit)]
    public struct CSGOWeapon
    {
        public enum CSGO_Weapon_ID
        {
            weapon_none = 0,
            weapon_deagle,
            weapon_elite,
            weapon_fiveseven,
            weapon_glock,
            weapon_p228,
            weapon_usp,
            weapon_ak47,
            weapon_aug,
            weapon_awp,
            weapon_famas,
            weapon_g3sg1,
            weapon_galil,
            weapon_galilar,
            weapon_m249,
            weapon_m3,
            weapon_m4a1,
            weapon_mac10,
            weapon_mp5navy,
            weapon_p90,
            weapon_scout,
            weapon_sg550,
            weapon_sg552,
            weapon_tmp,
            weapon_ump45,
            weapon_xm1014,
            weapon_bizon,
            weapon_mag7,
            weapon_negev,
            weapon_sawedoff,
            weapon_tec9,
            weapon_taser,
            weapon_hkp2000,
            weapon_mp7,
            weapon_mp9,
            weapon_nova,
            weapon_p250,
            weapon_scar17,
            weapon_scar20,
            weapon_sg556,
            weapon_ssg08,
            weapon_knifegg,
            weapon_knife,
            weapon_flashbang,
            weapon_hegrenade,
            weapon_smokegrenade,
            weapon_molotov,
            weapon_decoy,
            weapon_incgrenade,
            weapon_c4
        };

        [FieldOffset(0x131C)]
        public int m_iItemDefinitionIndex;

        [FieldOffset(0x15B4)]
        public int m_iState;

        [FieldOffset(0x15c0)]
        public int m_iClip1;

        [FieldOffset(0x159C)]
        public float m_flNextPrimaryAttack;

        [FieldOffset(0x15F9)]
        public bool m_bCanReload;

        [FieldOffset(0x162C)]
        public int m_iWeaponTableIndex;

        [FieldOffset(0x1670)]
        public float m_fAccuracyPenalty;

        [FieldOffset(0x1690)]
        public int m_iWeaponID;

        public bool IsValid()
        {
            return this.m_iWeaponID > 0 && this.m_iItemDefinitionIndex > 0;
        }

        public bool IsFullAuto()
        {
            return this.IsAssaultRifle() || this.IsMachinePistol() || this.IsMachineGun();
        }
        public bool IsNonAim()
        {
            return
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_knifegg ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_knife ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_flashbang ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_hegrenade ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_smokegrenade ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_molotov ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_decoy ||
                this.m_iWeaponID == (int)CSGO_Weapon_ID.weapon_incgrenade ||
